EdXian/nrf52-ota/main.c
#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

/* Define the test parameters */
#define TIMER_TEST_PIN        (12)
#define TIMER_TEST_PIN2       (8)
#define SEND_TEST_DATA        (false)

NRF_BLE_GATT_DEF(m_gatt);              /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);    /**< Advertising module instance. */
BLE_BIOLOGUE_DEF(m_biologue);          /**< Biologue BLE sensor collector service. */
APP_TIMER_DEF(adc_timer_id);           /**< ADC timer define, set as 256 Hz */


BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
                                                        /**< Context for the Queued Write module.*/



const nrf_drv_timer_t TIMER_ADC = NRF_DRV_TIMER_INSTANCE(1);
extern volatile uint32_t global_tick;
extern ads1018_t ads1018;
extern ad8232_t ad8232;
extern time_t time_now;
extern volatile uint8_t notify_data[VALUE_LEN_NOTIFY];
extern uint8_t ecg_buf[VALUE_LEN_ECG_RAW];
extern uint8_t temp_buf[VALUE_LEN_TEMP];
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
extern volatile uint8_t flag_notify;
extern volatile uint8_t flag_notify_ok;

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifiers. */
    {
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

static void advertising_start(bool erase_bonds);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt) {
  pm_handler_on_pm_evt(p_evt);
  pm_handler_flash_clean(p_evt);

  switch (p_evt->evt_id) {
  case PM_EVT_PEERS_DELETE_SUCCEEDED:
    advertising_start(false);
    break;

  default:
    break;
  }
}

#if SEND_TEST_DATA
volatile uint8_t ccc = 0;
#endif
volatile uint16_t st = 0;
// timer 256 Hz
void adc_timer_handler(nrf_timer_event_t event_type, void * p_contex) {
  uint32_t err_code;
#ifdef TIMER_TEST_PIN
  nrf_gpio_pin_set(TIMER_TEST_PIN);
  nrf_gpio_pin_set(TIMER_TEST_PIN2);
#endif
  ads1018.adc_process();
  int start_index;
  int temp_index = 0;
  uint8_t *t_p;
  uint16_t checksum = 0;
  
  // conversion complete, prepare data to send
  if(ads1018.ok_flag) {
    ad8232.update_lod();
    start_index = st;
    t_p = (uint8_t *)&global_tick;
#ifdef TIMER_TEST_PIN
    nrf_gpio_pin_clear(TIMER_TEST_PIN2);
#endif
    for(int i=0;i<4;i++) {
        checksum += t_p[3-i];
        notify_data[i] = t_p[3-i];
    }
    memcpy((uint8_t *)&notify_data[4], (uint8_t *)&ads1018.data[start_index], 128);
    for(int i=0;i<128;i++) {
      checksum += notify_data[i+4];
    }
#if SEND_TEST_DATA
    memset((char *)&notify_data[4], ccc++, VALUE_LEN_ECG_RAW-8);
#endif /* SEND_TEST_DATA */

    ads1018.temp |= ad8232.lod_status;
    notify_data[VALUE_LEN_ECG_RAW-4] = (ads1018.temp&0xFF00) >> 8;
    notify_data[VALUE_LEN_ECG_RAW-3] = (ads1018.temp&0x00FF);
    notify_data[VALUE_LEN_ECG_RAW-2] = (checksum&0xFF00) >> 8;
    notify_data[VALUE_LEN_ECG_RAW-1] = (checksum&0x00FF);
    if(flag_notify) {   // send command to replace this flag
      err_code = ecg_data_notify(&m_biologue);
      if(err_code != NRF_SUCCESS) {
          NRF_LOG_INFO("Notify error %x", err_code);
      }
    }
    st += 64;
    if(st >= ADS1018_BUF_SIZE) st = 0;
    ads1018.ok_flag = false;
  }
  global_tick++;
#ifdef TIMER_TEST_PIN
  nrf_gpio_pin_clear(TIMER_TEST_PIN);
#endif
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void) {
  uint32_t err_code = NRF_SUCCESS;
  nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
  err_code = nrf_drv_timer_init(&TIMER_ADC, &timer_cfg, adc_timer_handler);
  APP_ERROR_CHECK(err_code);

  /* Sampling period = 1/256 */
  nrf_drv_timer_extended_compare(
       &TIMER_ADC, NRF_TIMER_CC_CHANNEL0, 62500, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

#ifdef TIMER_TEST_PIN
  nrf_gpio_cfg_output(TIMER_TEST_PIN);
  nrf_gpio_cfg_output(TIMER_TEST_PIN2);
#endif

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
  ret_code_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
      (const uint8_t *)DEVICE_NAME,
      strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void) {
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
  err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}



