EdXian/nrf52-ota/main.c
void ota_resposnse_ack(ota_state state, ota_ack_type ack_type){
	uint8_t data[2] = {state, ack_type};
	uint16_t size = sizeof(data);
	ble_nus_data_send(&m_nus, data, &size, NULL);
}

void ota_resposnse_ver(uint32_t ver){
  uint8_t data[4] = {check_version_state , (ver>>0) , (ver>>8) , (ver>>16)};
  uint16_t size = sizeof(data);
  ble_nus_data_send(&m_nus, data,&size,NULL);
}

extern uint8_t ota_buffer[OTA_BUFFER_SIZE];
ota_control_t m_ota_ctrl;
ota_start_cmd_t start_cmd;
ota_write_cmd_t write_cmd;
ota_verify_cmd_t verify_cmd;
ota_clearrom_cmd_t clearrom_cmd;
ota_key_cmd_t key_cmd;


int8_t checksum_error(uint8_t* data, uint16_t len){
    int8_t sum = 0;
    for(uint16_t i=0;i<len;i++){
      sum+=data[i]; 
    }
  return sum;
}



uint8_t data_compare(uint8_t* data, uint16_t len){
  for(unsigned int i=0;i<len;i++){
    if(data[i] !=  ota_buffer[i]) return 1;
  }
  return 0;
}

uint8_t ecdsa_verify(void);

uint8_t err_count = 0;
static int16_t clear_count = 0;
void ota_update_handle(uint8_t* flag){
    uint8_t ret = 0 ;
    uint8_t pass = 0;
	switch (*flag){
              case idle_flag:
              *flag = idle_flag;
                      break;
              case flash_flag:
                      
                      ret = ota_flash_write(start_cmd.addr, ota_buffer, start_cmd.recv_len);
                      m_ota_ctrl.checksum = checksum_error((uint8_t*)start_cmd.addr, start_cmd.recv_len);

                      if( (ret==0) ){

                         ota_resposnse_ack(flash_state,ota_write_pass);
                       
                      }else{

                        ota_resposnse_ack(flash_state,ota_write_fail);
                        
                      }
                      
                      *flag = idle_flag;
                      break;

              case clear_flag:
                      

                      // erase flash failed some times   CPU is halted when NVMC is cleaning the flash
                      
                      
                      ret = ota_flash_erase(clearrom_cmd.start_addr, clearrom_cmd.end_addr);
                  
                      //we should check the memory is reset to 0xff 
                      nrf_delay_ms(400);

                      uint32_t data = *((uint32_t*)clearrom_cmd.start_addr);
                      
                      if( data != EMPTY_DATA )
                      {
                        ota_resposnse_ack(clearrom_state,ota_clear_fail);
                        printf("not erase\r\n");
                        break;
                      }
                      
                      if( (ret == 0)  && (data == EMPTY_DATA) ){
                        ota_resposnse_ack(clearrom_state,ota_clear_pass);
                        printf("cp %d\r\n",clear_count);
                      }else if( (ret == 0) && (data!=EMPTY_DATA)){
                        ota_resposnse_ack(clearrom_state,ota_clear_fail);
                        printf("cf %d\r\n",clear_count);
                      }else{
                        printf("ce %d\r\n",clear_count);
                      }
                      
                      *flag = idle_flag;

                      break;
              case start_flag:
                     
                      break;
              case write_flag:
                      
                 
                      break;
              
              case verify_flag:
                       
                      break;

              case key_flag:
                    nrf_drv_timer_disable(&TIMER_ADC);  //disable timer
                    clear_count++;
                    pass = ecdsa_verify();
                    
                    if(pass == 1){
                      ota_resposnse_ack(key_state,ota_key_fail);
                      m_ota_ctrl.key_pass  = 1;
                    }else if(pass == 0){
                      ota_resposnse_ack(key_state,ota_key_pass);
                      m_ota_ctrl.key_pass  = 0;
                      printf("k %d\r\n",clear_count);
                    }else{
                      ota_resposnse_ack(key_state,10);
                    }
                    
                    memset(&key_cmd,0,sizeof(key_cmd));
                    *flag = idle_flag;
                      break;

              case burn_flag:
                      
                    //update mcu here
                      break;
              default:
                      break;
      }
}



static void ota_data_handler(ble_nus_evt_t * p_evt)
{
    uint32_t* tmp;
    uint8_t* tmp8_t;
    uint8_t head = 0x00;
    uint32_t ver = 0;
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
      uint32_t err_code;
      head = p_evt->params.rx_data.p_data[0];
      
      switch (head){
              case key_state:
                    tmp = (uint32_t*)&p_evt->params.rx_data.p_data[0];
                    //key_cmd = *(ota_key_cmd_t*)tmp;                 
                    memcpy(&key_cmd, tmp, sizeof(key_cmd));
                    
                    m_ota_ctrl.flag = key_flag;
                    break;

              case start_state:
                                                              
                    tmp = (uint32_t*)&p_evt->params.rx_data.p_data[0];
                    start_cmd = *(ota_start_cmd_t*)tmp;
                    memset(ota_buffer , 0 , OTA_BUFFER_SIZE);    //clear ota tmp buffer
                    m_ota_ctrl.write_count = 0x00;
                    m_ota_ctrl.checksum =  0 ;
                    

                    //checking flash is empty
                    if((*(uint32_t*)start_cmd.addr) != EMPTY_DATA){
                       //ota_resposnse_ack(start_state,ota_flash_noempty);
                       printf("not empty\r\n");
                       m_ota_ctrl.flag = clear_flag;  //reset the flash
                       break;
                    };


                    if(m_ota_ctrl.key_pass == 1){       //ota_key_fail
                      ota_resposnse_ack(start_state,ota_key_fail);
                      break;
                    }

                    //check size and write address
                    if(  (start_cmd.recv_len < otadata_max_size)  || 
                          ((start_cmd.addr)>=otadata_start_address && (start_cmd.addr)<otadata_end_address)
                      ){
                      ota_resposnse_ack(start_state,ota_start_pass);
                      m_ota_ctrl.write_enable = true;
                      m_ota_ctrl.flag = start_flag;
                    }else{

