EdXian/nrf52-ota/main.c
                      if((start_cmd.recv_len >= otadata_max_size)){
                        ota_resposnse_ack(start_state,ota_size_overflow);
                      }else{
                        ota_resposnse_ack(start_state,ota_address_fail);
                      }
                      m_ota_ctrl.write_enable = false;
                      m_ota_ctrl.flag = idle_flag;
                   }
                  
                    //printf("start_state\r\n");
                    break;
              
              case write_state:

                    m_ota_ctrl.flag = write_flag;
                    tmp = (uint32_t*)&p_evt->params.rx_data.p_data[0];
                    tmp8_t = (uint8_t*)&p_evt->params.rx_data.p_data[2];
                    write_cmd = *(ota_write_cmd_t*)tmp;
                    

                    if(m_ota_ctrl.key_pass == 1){       //ota_key_fail
                      ota_resposnse_ack(key_state,ota_key_fail);
                      break;
                    }

                    if(m_ota_ctrl.write_enable){
                      if( m_ota_ctrl.write_count < OTA_BUFFER_SIZE ){
                        memcpy(&ota_buffer[m_ota_ctrl.write_count], tmp8_t, write_cmd.len);
                      }
                      m_ota_ctrl.write_count += write_cmd.len;
                      ota_resposnse_ack(write_state,ota_write_pass);
                      m_ota_ctrl.state = write_state;
                    }else{
                        ota_resposnse_ack(write_state,ota_write_fail);
                    }

                    //printf("write_state\r\n");
                  break;
                      
              case flash_state:
                      
                    if(m_ota_ctrl.key_pass == 1){       //ota_key_fail
                      
                      ota_resposnse_ack(key_state,ota_key_fail);
                      break;

                    }else{
                    
                      m_ota_ctrl.flag = flash_flag;
                    }


                      
                      //printf("flash_state\r\n");
                      break;
              
              case verify_state:  // verify
                      
                      tmp = (uint32_t*)&p_evt->params.rx_data.p_data[0];
                      verify_cmd = *(ota_verify_cmd_t*)tmp;						
                      m_ota_ctrl.state = verify_state;
                      m_ota_ctrl.flag = verify_flag;

                      if(m_ota_ctrl.key_pass == 1){       //ota_key_fail
                        ota_resposnse_ack(key_state,ota_key_fail);
                        break;
                      }  
                         
                      //use checksum to verify flash
                      if(m_ota_ctrl.checksum == verify_cmd.crc_value){
                        ota_resposnse_ack(verify_state,ota_verify_pass);
                       // printf("verify pass\r\n");
                      }else{
                        ota_resposnse_ack(verify_state,ota_verify_fail);
                         printf("page failed\r\n");
                      }
                      break;
              
             case clearrom_state:  // clear rom
                      

                    
                    tmp = (uint32_t*)&p_evt->params.rx_data.p_data[0];
                    clearrom_cmd = *(ota_clearrom_cmd_t*)tmp;
                    m_ota_ctrl.flag = clear_flag;

                   
                    break;

              case check_version_state:
                    //check the ver. of the Frimware.                     
                    ver =  ota_get_version();
                    ota_resposnse_ver(ver);

                    break;

              case label_state:


                    break;
              default:	
                      break;
      }
    }
}


static void services_init(void) {
    ret_code_t err_code;
    nrf_ble_qwr_init_t qwr_init = {0};
    ble_nus_init_t     nus_init;
    qwr_init.error_handler = nrf_qwr_error_handler;
    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);
    memset(&nus_init, 0, sizeof(nus_init));
    nus_init.data_handler = ota_data_handler;
    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) {
  ret_code_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) {
  //APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void) {
  ret_code_t err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting timers.
 */
static void application_timers_start(void) {
  nrf_drv_timer_enable(&TIMER_ADC);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void) {
  ret_code_t err_code;

  //err_code = bsp_indication_set(BSP_INDICATE_IDLE);
  //APP_ERROR_CHECK(err_code);

