EdXian/nrf52-ota/main.c
  // Handle any other events necessary...
}

static void biologue_services_init(void) {
    ret_code_t err_code;
    ble_biologue_service_init_t biologue_init;
  

    // Initialize the biologue service
    memset(&biologue_init, 0, sizeof(biologue_init));
    biologue_init.evt_handler = biologue_evt_handler;

    err_code = ble_biologue_service_init(&m_biologue, &biologue_init);
    NRF_LOG_INFO("Done with services_init()");
    APP_ERROR_CHECK(err_code);
}

static size_t m_signature_size;
static nrf_crypto_ecdsa_secp256r1_signature_t m_signature;

//encoding message by SHA256
static uint8_t m_hash[32] =
{
    0x07,0xf0,0x2a,0x70,0xa1,0xbe,0x9a,0x0e,
    0x52,0x04,0x12,0xbf,0xe9,0x0c,0x10,0xc0,
    0x96,0x98,0x8f,0x52,0x0b,0xbd,0x27,0xb1,
    0x24,0xd1,0x15,0xa0,0xed,0xd5,0x1f,0x63,
};


//static const uint8_t m_alice_raw_private_key[32] =
//{
// 0x9e,  0x97,  0xf7,  0x3d,  0x15,  0x7b,  0x38,  0x4, 
// 0x41,  0xfc,  0x69,  0x41,  0x29,  0x34,  0x77,  0x9c, 
// 0x6b,  0x46,  0xae,  0x4a,  0x37,  0xe,  0xec,  0x91, 
// 0xd7,  0x3a,  0x51,  0x5a,  0x0,  0x6d,  0x0,  0xf4, 
//};

static const uint8_t raw_public_key[64] =
{
 0x6d,  0x5e,  0xa,  0x21,  0x7a,  0xc1,  0xa4,  0xfc, 
 0x48,  0x3,  0xb8,  0x7c,  0xf8,  0x27,  0x47,  0xf4, 
 0xa9,  0xe7,  0xb4,  0xa,  0x5a,  0xd0,  0x51,  0x2, 
 0xb2,  0xec,  0x65,  0xc6,  0xce,  0xaa,  0x7e,  0x1, 
 0x24,  0x88,  0xb,  0x4b,  0xdd,  0x44,  0xaf,  0x5, 
 0x6a,  0xb1,  0x97,  0x7b,  0xc2,  0x71,  0xca,  0x17, 
 0x4,  0xc1,  0xc7,  0xfb,  0x17,  0x99,  0x2a,  0xd, 
 0x35,  0xd6,  0x63,  0x85,  0xd6,  0xa1,  0xd9,  0xbc,
 };

nrf_crypto_ecc_key_pair_generate_context_t  keygen_context;
nrf_crypto_ecc_secp256r1_private_key_t      private_key;
nrf_crypto_ecc_secp256r1_public_key_t       public_key;

uint8_t ecdsa_verify(void)
{
   // static nrf_crypto_ecc_public_key_t alice_public_key;
    ret_code_t                         err_code = NRF_SUCCESS;
    uint8_t state;

    err_code = nrf_crypto_ecc_public_key_from_raw(&g_nrf_crypto_ecc_secp256r1_curve_info,
                                                  &public_key,
                                                  raw_public_key,
                                                  sizeof(raw_public_key));
    
    memcpy(m_signature, &key_cmd.key[0], 64); //copy signature from ble packet
    m_signature_size = sizeof(m_signature);

    err_code = nrf_crypto_ecdsa_verify(NULL,
                                       &public_key,
                                       m_hash,
                                       sizeof(m_hash),
                                       m_signature,
                                       m_signature_size);

    if (err_code == NRF_SUCCESS)
    {
        state = 0;
        printf("ecdsa pass\r\n");
    }
    else if (err_code == NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE)
    {
       state = 1;
       printf("ecdsa fail\r\n");
    }
    else
    {
      state =2;
      printf("ecdsa error\r\n");
    }
 
     err_code = nrf_crypto_ecc_public_key_free(&public_key);
     return  state;
}


int main(void) {  
  bool erase_bonds = false;
  ret_code_t err_code = NRF_SUCCESS;

  log_init();
  power_management_init();
  init_uart();

  err_code = nrf_mem_init();
  err_code = nrf_crypto_init();

  ble_stack_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  biologue_services_init();
  conn_params_init();
  peer_manager_init();
  timers_init();
  init_rtc();
  //fatfs_example ();
  ad8232.init();
  ads1018.init();
  ota_flash_init();

//  NRF_LOG_INFO("GAP Length: %d", NRF_SDH_BLE_GAP_DATA_LENGTH);
//  NRF_LOG_INFO("GATT MTU: %d", NRF_SDH_BLE_GATT_MAX_MTU_SIZE);

  

   

  advertising_start(erase_bonds);
  application_timers_start();

  for (;;) {

    ota_update_handle(&(m_ota_ctrl.flag));
    
    //printf("\r\n=signature=\r\n");
    //nrf_delay_ms(10);
    //for (uint16_t i=0;i<64;i++){
    //    if(i!=0 && i%8==0){
    //      printf("\n");         
    //    }
    //    printf("0x%x,", m_signature[i]);
    //     //nrf_delay_ms(10);
    //}


  }
}



void HardFault_Handler(void) {
  NRF_LOG_INFO("HardFault Handle");
      __ASM volatile(

    "push {lr}                      \n"

    /* reserve space on stack for error_info_t struct - preserve 8byte stack aligment */
    "sub sp, sp, %0                 \n"

    /* prepare error_info_t struct */
    "str r0, [sp, %1]               \n"
    "str r1, [sp, %3]               \n"
    "str r2, [sp, %2]               \n"

    /* prepare arguments and call function: app_error_fault_handler */
    "ldr r0, =%4                    \n"
    "mov r1, lr                     \n"
    "mov r2, sp                     \n"
    "bl  %5                         \n"

    /* release stack */
    "add sp, sp, %0                 \n"

    "pop {pc}                       \n"
    ".ltorg                         \n"

    : /* Outputs */
    : /* Inputs */
    "I" (APP_ERROR_ERROR_INFO_SIZE_ALIGNED_8BYTE),
    "I" (APP_ERROR_ERROR_INFO_OFFSET_ERR_CODE),
    "I" (APP_ERROR_ERROR_INFO_OFFSET_P_FILE_NAME),
    "I" (APP_ERROR_ERROR_INFO_OFFSET_LINE_NUM),
    "X" (NRF_FAULT_ID_SDK_ERROR),
    "X" (app_error_fault_handler)
    : /* Clobbers */
    "r0", "r1", "r2"
    );
  while(true) {
    __asm("nop");
  }
}

/**
 * @}
 */